In [ ]:
#concatenacion de data frames
concatenar=juntar, unir o fusionar 

Para dataframes, existen 3 formas de concatenar:
-concat (conctenar)
-Merge(fensionar) 
-Join (unir)

In [ ]:
# concat 

esta tecnica basicamente se centra en base de datos comunes, ie tienen las mismas columnas y por tanto basicamnte hay que juntar las filas

In [4]:
import pandas as pd

In [15]:
df1=pd.DataFrame({'A':['1A', '2A'], 'B':['1B', '2B'], 'C':['1C','2C'] } ) 
df2=pd.DataFrame({'A':['6A', '7A', '8A'], 'B':['6B', '7B', '8B'], 'C':['6C','7C','8C'] } )

In [16]:
df1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [17]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [18]:
pd.concat([df1,df2])

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [20]:
pd.concat([df1,df2], ignore_index=True)

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

In [ ]:
# Merge (fusionar) 
Edta tecnica fusiona duferentes daraframes a partur de una columna clave en comun

In [41]:
df1=pd.DataFrame({'A':['1A', '2A', '3A'], 'B':['1B', '2B', '3A'] } ) 
df2=pd.DataFrame({'A':['5A', '6A'], 'C':['1C','2C'], 'K':['1K', '2K'] } )

In [42]:
df1

    A   B
0  1A  1B
1  2A  2B
2  3A  3A

In [43]:
df2

    A   C   K
0  5A  1C  1K
1  6A  2C  2K

In [44]:
pd.merge(df1,df2, on=['A'])

Empty DataFrame
Columns: [A, B, C, K]
Index: []

In [45]:
pd.merge(df1,df2, on=['A'], how='outer')

    A    B    C    K
0  1A   1B  NaN  NaN
1  2A   2B  NaN  NaN
2  3A   3A  NaN  NaN
3  5A  NaN   1C   1K
4  6A  NaN   2C   2K

In [46]:
pd.merge(df1,df2, on=['A'], how='inner')

Empty DataFrame
Columns: [A, B, C, K]
Index: []

In [47]:
pd.merge(df1,df2, on = ['A'], how = 'left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN
2  3A  3A  NaN  NaN

In [ ]:
# Join
LA idea de este dataframe es combinar las columnas de dos dataframes indexados

In [55]:
df1=pd.DataFrame({'Z':['1A', '2A', '3A'], 'B':['1B', '2B', '3A'] } , index= ['i1','i2','i3'])
df2=pd.DataFrame({'A':['5A', '6A'], 'C':['1C','2C'], 'K':['1K', '2K'] }, index= ['i1','i2'])

In [56]:
df1

     Z   B
i1  1A  1B
i2  2A  2B
i3  3A  3A

In [57]:
df2

     A   C   K
i1  5A  1C  1K
i2  6A  2C  2K

In [58]:
df1.join(df2)

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3A  NaN  NaN  NaN

In [59]:
# Entradas y salidas
df3=df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3A  NaN  NaN  NaN

In [82]:
df3.to_csv('nombre.csv', index = False)

In [65]:
pd.read_csv('otra cosa.csv')

  Unnamed: 0   Z   B    A    C    K
0         i1  1A  1B   5A   1C   1K
1         i2  2A  2B   6A   2C   2K
2         i3  3A  3A  NaN  NaN  NaN

In [ ]:
pd.read_csv(